/* @(#)28  1.37 src/bos/kernext/c327/c327dd.h, sysxc327, bos411, 9430C411a 7/27/94 09:31:32 */
#ifndef _H_C327DD
#define _H_C327DD

/*
 * COMPONENT_NAME: (SYSXC327) c327 device driver header file
 *
 * FUNCTIONS:    N/A
 *
 * ORIGINS: 27
 *
 * IBM CONFIDENTIAL -- (IBM Confidential Restricted when
 * combined with the aggregated modules for this product)
 *                  SOURCE MATERIALS
 * (C) COPYRIGHT International Business Machines Corp. 1989, 1991
 * All Rights Reserved
 * Licensed Materials - Property of IBM
 *
 * US Government Users Restricted Rights - Use, duplication or
 * disclosure restricted by GSA ADP Schedule Contract with IBM Corp.
 */                                                                   

/*****************************************************************************/
/* declarations common to c327dd, cut, diag, tca, & dftns                    */
/*****************************************************************************/

#include <sys/uio.h>

#ifdef _POWER_MP
#include <sys/lock_def.h>
#define DISABLE_INTERRUPTS(sil) sil=disable_lock(c327_intr_level, \
						(&c327_intr_lock))
#define RESTORE_INTERRUPTS(sil) unlock_enable(sil, (&c327_intr_lock))
#else
#include <sys/lockl.h>
#define DISABLE_INTERRUPTS(sil) sil=i_disable(c327_intr_level)
#define RESTORE_INTERRUPTS(sil) i_enable(sil)
#endif

#define boolean unsigned char
extern int c327_intr_level;

/*****************************************************************************/

#define RC_NON_SUPP_CU    0x8306 /* non-supported control unit            */
#define RC_HOST_CONTEN    0x8307 /* cmd rejected due to host contention   */
#define RC_NOT_OPEN       0x8308 /* adapter port not opened               */
#define RC_OPEN_BUSY      0x830B /* open in progress -- try later         */
#define RC_NO_SESS_AVAIL  0x8601 /* available session not found           */
#define RC_INVAL_PARMS    0x8800 /* invalid parameters passed             */
#define RC_INVAL_NETID    0x8802 /* invalid network id parameter passed   */
#define RC_CMD_NOT_VALID  0x8804 /* command is not valid at this time     */

/* status codes passed to device head interrupt handler */
#define OR_NO_ERROR       0x0000      /* no error               */
#define OR_REC_DATA_AVAIL 0x8100      /* receive data available */
#define OR_LOCK           0x0900      /* CU/Device locked       */
#define OR_UNLOCK         0x0A00      /* CU/Device unlocked     */
#define OR_CHK_STAT_MSK   0x2000      /* Check Status Sent Mask */
#define OR_CU_DOWN        0x8905      /* control unit down      */
#define OR_RESTART_DONE   0x8906      /* wcus redy received after restart */
#define OR_WRITE_DISCARD  0x8907      /* write command was thrown away */
#define OR_SNA_INFO       0x10000     /* SNA WCUS 40 or 41      */
#define OR_SOFT_DSC       0x20000     /* Non-fatal disconnect   */
#define OR_SNA_RUSIZE     0x40000     /* broadcast inbound size to app.*/

/* or'ed with cu_error to indicate error class */
#define BROADCAST_MSK     0x8000      /* Broadcast Bit Mask                  */
#define MC_ERROR_MSK      0x1000      /* Machine Check Mask (Broadcast)      */
#define PC_ERROR_MSK      0x2000      /* Program Check Mask (one session)    */
#define CC_ERROR_MSK      0x4000      /* Communication Check Msk (Broadcast) */

/*****************************************************************************/
/* parameters passed between dftns package and device head */
/*****************************************************************************/
#define SESS_TYPE_TERMINAL       0 /* terminal session                       */
#define SESS_TYPE_PRINTER        1 /* printer session                        */
#define SEND_STAT_ACK            0 /* prev rec'd data/cmd ok, make response  */
#define SEND_STAT_OKDATA         1 /* valid read rec'd, write will follow    */
#define SEND_STAT_KBD_RESET      2 /* 3270 reset key pressed                 */
#define SEND_STAT_PRINT_COMPLETE 3 /* print complete                         */
#define SEND_STAT_DEV_NOT_SEL  107 /* cmd rec'd for device not selected      */
#define SEND_STAT_BUFFER_ERR   109 /* bad buf order or invalid buf adr rec'd */
#define SEND_STAT_BAD_CMD      110 /* non-3270 cmd rec'd                     */
#define SEND_STAT_UNSUPP_CMD   111 /* unsupported 3270 cmd rec'd             */

/*
** Everything you ever wanted to know about the 
** dd read, write and auto ack data buffer
*/

/*
** This number choosen to handle screen size up thru model 5.
** Whip also defaults to this. 
*/

#define LO_BUFSIZE    3456

struct dbhead {
	int             buff_size;
	boolean         buf_ovrflw;
	int     	data_len;	/* number of bytes in data area */
	int     	data_offset;	/* number of bytes currently */
};

typedef struct Data_Buffer {
	struct dbhead  dbhead;
	char	       buf_start;	/* start of the buffer */
} Data_Buffer;	

typedef struct {
                      /* network id parameter */
  char  adapter_code; /* minor # of adapter card  */
                      /* for this command (1 to MAX_MINORS) */
  char  session_code; /* session for this command (1 to MAX_SESSIONS) */
} NETWORK_ID;

/*****************************************************************************/
/* the interrupt type passed to AckCmd, InterruptDH, and dh intr handler     */
/*****************************************************************************/
typedef enum 
{
   INTR_UNSOL,                 /* Unsolicited interrupt                   */
   INTR_SOL_START,             /* Start Device Solicited                  */
   INTR_SOL_WRITE              /* Write Device Solicited                  */
} INTR_TYPE;

/*****************************************************************************/
/* special values of cu_type used to detect special cases */
/*****************************************************************************/
#  define BSC_3274    0x42        /* 3274    type BSC CU                     */
#  define CH_3274     0xC2        /* 3274    type Channel CU                 */
#  define CH_4361     0xC3        /* 4361    type Channel CU                 */

/*****************************************************************************/
/* special values of the TCA data header flag char for read/write */
/*****************************************************************************/
#  define F_O_M        0x80       /* first of message */
#  define L_O_M        0x40       /* last  of message */
#  define BSC_TRANSPAR 0x10       /* BSC transparency */
#  define BSC_TEST_REQ 0x04       /* BSC test request */

/*****************************************************************************/
/* the TCA, that is, the directly addressable adapter memory */
/*****************************************************************************/
#define MAX_CULTA 8   /* this is a control unit definition - don't change it */

/* WARNING!  Multi-char quantities in this structure must be ms char to ls */
typedef volatile struct
{
      char      dpastat;                 /*        000   |        0000 */
      char      dpsstat;                 /*        001   |        0001 */
      char      dssv;                    /*        002   |        0002 */
      char      dssp1;                   /*        003   |        0003 */
      char      dssp2;                   /*        004   |        0004 */
      char      dssp3;                   /*        005   |        0005 */
      char      daltad;                  /*        006   |        0006 */
      char      daev;                    /*        007   |        0007 */
      char      daep1;                   /*        008   |        0008 */
      char      daep2;                   /*        009   |        0009 */
      char      daep3;                   /*        010   |        000A */
      char      daep4;                   /*        011   |        000B */
      char      dtid1;                   /*        012   |        000C */
      char      dtid2;                   /*        013   |        000D */
      char      dtid3;                   /*        014   |        000E */
      char      dtid4;                   /*        015   |        000F */
      char      dbuf_msb;                /*        016   |        0010 */
      char      dbuf_lsb;                /*        017   |        0011 */
      char      reserved1[2];            /*  018 - 019   | 0012 - 0013 */
      char      reserved2[4];            /*  020 - 023   | 0014 - 0017 */
      char      reserved3[4];            /*  024 - 027   | 0018 - 001B */
      char      reserved4[4];            /*  028 - 031   | 001C - 001F */
      char      exflt;                   /*        032   |        0020 */
      char      exfrq;                   /*        033   |        0021 */
      char      exfp1;                   /*        034   |        0022 */
      char      exfp2;                   /*        035   |        0023 */
      char      exfp3;                   /*        036   |        0024 */
      char      exfp4;                   /*        037   |        0025 */
      char      exfak;                   /*        038   |        0026 */
      char      reserved5;               /*        039   |        0027 */
      char      reserved6[4];            /*  040 - 043   | 0028 - 002B */
      char      reserved7[4];            /*  044 - 047   | 002C - 002F */
      char      reserved8[4];            /*  048 - 051   | 0030 - 0033 */
      char      reserved9[4];            /*  052 - 047   | 0034 - 0037 */
      char      reserved10[4];           /*  056 - 059   | 0038 - 003B */
      char      reserved11[4];           /*  060 - 063   | 003C - 003F */

/*****************************************************************************/
/* second half of the TCA */
/*****************************************************************************/

      char      cudp_msb;                /*        064   |        0040 */
      char      cudp_lsb;                /*        065   |        0041 */
      char      cultad;                  /*        066   |        0042 */
      char      reserved12;              /*        067   |        0043 */
      char      cufrv;                   /*        068   |        0044 */
      char      cusyn;                   /*        069   |        0045 */
      char      cufrp1;                  /*        070   |        0046 */
      char      cufrp2;                  /*        071   |        0047 */
      char      cufrp3;                  /*        072   |        0048 */
      char      cufrp4;                  /*        073   |        0049 */
      char      reserved13;              /*        074   |        004A */
      char      reserved14;              /*        075   |        004B */
      char      reserved15[4];           /*  076 - 079   | 004C - 004F */
      char      cudport;                 /*        080   |        0050 */
      char      cuat;                    /*        081   |        0051 */
      char      cudser_msb;              /*        082   |        0052 */
      char      cudser_lsb;              /*        083   |        0053 */
      char      culta[MAX_CULTA];        /*  084 - 091   | 0054 - 005B */
      char      exfd1;                   /*        092   |        005C */
      char      exfd2;                   /*        093   |        005D */
      char      exfd3;                   /*        094   |        005E */
      char      exfd4;                   /*        095   |        005F */
      char      extime;                  /*        096   |        0060 */
      char      cudsl;                   /*        097   |        0061 */
      char      reserved16[2];           /*  098 - 099   | 0062 - 0063 */
      char      reserved17[4];           /*  100 - 103   | 0064 - 0067 */
      char      reserved18[4];           /*  104 - 107   | 0068 - 006B */
      char      reserved19[4];           /*  108 - 111   | 006C - 006F */
      char      reserved20[4];           /*  112 - 115   | 0070 - 0073 */
      char      reserved21[4];           /*  116 - 119   | 0074 - 0077 */
      char      reserved22[4];           /*  120 - 123   | 0078 - 007B */
      char      reserved23[2];           /*  124 - 125   | 007C - 007D */
      char      cuslvl_1;                /*        126   |        007E */
      char      cuslvl_2;                /*        127   |        007F */
} tca_t;

/*****************************************************************************/
/* sub-structure DDS_HDW_SECTION of DDS_DATA */
/*****************************************************************************/
#define MAX_NUM_BUS 2               /* number of i/o adapters                */
typedef volatile struct
{
      int     bus_mem_size;         /* size of adapter bus memory            */
      int     bus_mem_beg;          /* begin of adapter bus memory           */
      int     io_port;              /* port base (2D0,6D0,AD0,or ED0)        */
      int     slot_number;          /* slot number for this card             */
      int     last_disconnect;      /* time of last disconnect (init to 0)   */
